Revit 2024 API
PointCloudInstance.GetScanOrigin Method
 Returns the origin point of a scan in model coordinates.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public XYZ GetScanOrigin(
	string scanName
)
Visual Basic
Public Function GetScanOrigin ( _
	scanName As String _
) As XYZ
Visual C++
public:
XYZ^ GetScanOrigin(
	String^ scanName
)
Parameters
scanName
Type: System.String
 Name of the scan.
Return Value
 Resulting origin point of the scan.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  PointCloudInstance does not contain scan scanName.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
PointCloudInstance Class
Autodesk.Revit.DB Namespace